package com.xiaosuokeji.framework.android.xsrefreshlayout;

/**
 * 功能：
 * -------------------------------------------------------------------------------------------------
 * 创建者：陈佳润
 * -------------------------------------------------------------------------------------------------
 * 创建日期：17/3/31
 * -------------------------------------------------------------------------------------------------
 * 更新历史(日期/更新人/更新内容)
 */
public interface XSRefreshController {

    /**
     * 当前下拉刷新是否可用
     */
    boolean canRefresh();

    /**
     * 当前上拉加载是否可用，比如列表已无更多数据，可禁用上拉加载功能
     */
    boolean canLoadMore();

}
