package com.xiaosuokeji.framework.android.xsrefreshlayout.loadview;

/**
 * 功能：
 * -------------------------------------------------------------------------------------------------
 * 创建者：陈佳润
 * -------------------------------------------------------------------------------------------------
 * 创建日期：17/3/31
 * -------------------------------------------------------------------------------------------------
 * 更新历史(日期/更新人/更新内容)
 */
public interface XSLoadView {

    /**
     * 在下拉或上拉的过程中，有时会有指示器跟随旋转的需求，通过此方法，进行控制
     */
    public void setProgressRotation(float rotation);

    /**
     * 开始动画,当下拉后或上拉后释放时调用
     */
    public void start();

    /**
     * 停止动画，当下拉或上拉完成时调用
     */
    public void stop();

}
